Autodesk.Revit.DB.RenderEngine
Controls Render Engine in use
Since:
2014

Autodesk.Revit.DB.RenderEngine.RapidRT
Rapid Ray Trace as render engine

Autodesk.Revit.DB.RenderEngine.MentalRay
Mental Ray as render engine